[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-       this._distribution = new Map<number, number>();
-	this._last = 0;
- 	if (faces < 2) {
-      		this._faces = 6;
-    	} 
-	else 
-	{
-      		this._faces = faces;
-    	}
-   }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Survived] ConditionalExpression
src/Roller.ts:12:7
     constructor(faces: number) {
        this._distribution = new Map<number, number>();
 	this._last = 0;
- 	if (faces < 2) {
+ 	if (false) {
       		this._faces = 6;
     	} 

[Survived] ConditionalExpression
src/Roller.ts:12:7
     constructor(faces: number) {
        this._distribution = new Map<number, number>();
 	this._last = 0;
- 	if (faces < 2) {
+ 	if (true) {
       		this._faces = 6;
     	} 

[Survived] BlockStatement
src/Roller.ts:16:2
       		this._faces = 6;
     	} 
 	else 
-	{
-      		this._faces = faces;
-    	}
+	{}
    }
 

[Killed] BlockStatement
src/Roller.ts:31:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        //return value;
-	  if (value < 1 || value > this._faces) {
-      return 0;
-    } else {
-      this._last = value;
-      this._distribution.set(value, (this._distribution.get(value) || 0) + 1);
-      return value;
-    }
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/Roller.ts:33:42
     //      of rolls for that face by 1
     roll(value: number): number{
         //return value;
-	  if (value < 1 || value > this._faces) {
-      return 0;
-    } else {
+	  if (value < 1 || value > this._faces) {} else {
       this._last = value;
       this._distribution.set(value, (this._distribution.get(value) || 0) + 1);
killedBy: Roller tests Roller tests Roll invalid -1 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:33:21
     //      of rolls for that face by 1
     roll(value: number): number{
         //return value;
-	  if (value < 1 || value > this._faces) {
+	  if (value < 1 || value <= this._faces) {
       return 0;
     } else {
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/Roller.ts:35:12
         //return value;
 	  if (value < 1 || value > this._faces) {
       return 0;
-    } else {
-      this._last = value;
-      this._distribution.set(value, (this._distribution.get(value) || 0) + 1);
-      return value;
-    }
+    } else {}
     }
 
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Survived] ConditionalExpression
src/Roller.ts:37:38
       return 0;
     } else {
       this._last = value;
-      this._distribution.set(value, (this._distribution.get(value) || 0) + 1);
+      this._distribution.set(value, (false) + 1);
       return value;
     }

[Survived] LogicalOperator
src/Roller.ts:37:38
       return 0;
     } else {
       this._last = value;
-      this._distribution.set(value, (this._distribution.get(value) || 0) + 1);
+      this._distribution.set(value, (this._distribution.get(value) && 0) + 1);
       return value;
     }

[Killed] BlockStatement
src/Roller.ts:44:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-	if (this._last === undefined) {
-    return 0;
-  } else {
-    return this._last;
-  }
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: Roller tests Roller tests No Roll Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:45:6
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-	if (this._last === undefined) {
+	if (true) {
     return 0;
   } else {
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/Roller.ts:45:6
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-	if (this._last === undefined) {
+	if (this._last !== undefined) {
     return 0;
   } else {
killedBy: Roller tests Roller tests Roll 5 and get 5 Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/Roller.ts:47:10
     last(): number {
 	if (this._last === undefined) {
     return 0;
-  } else {
-    return this._last;
-  }
+  } else {}
     }
 
killedBy: Roller tests Roller tests No Roll Test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
